Repository: Mixage-Software/4D-Report-Manager
Catalog: Resources/*.lproj/STR#.xlf
Languages: it

# Page &lt;p1&gt;
source: Page <p1>
it: Pagina <p1>

source: Print Preview
it: Anteprima

source: Master Table
it: Tabella Principale

source: Related Tables
it: Tabelle in relazione

source: All Tables
it: Tutte le tabelle

source: Report Columns
it: Colonne del Rapporto

source: Report parameters
it: Parametri rapporto

source: Master Table
it: Tabella principale

source: Report Type
it: Tipo Rapporto

source: List
it: Lista

source: Cross table
it: Incrociato

source: Available fields
it: Campi disponibili

source: Sort order
it: Ordinamento

source: Only automatic relations
it: Solo relazioni automatiche

source: All relations in automatic
it: Tutte le relazioni automatiche

source: Open wizard
it: Procedura guidata

source: 1-Columns
it: 1-Colonne

source: 2-Rows
it: 2-Righe

source: No sort
it: Nessun ordinamento

source: From left to right
it: Da sinistra a destra

source: From right to left
it: Da destra a sinistra

source: From bottom to top
it: Dal basso verso l'alto

source: From top to bottom
it: Dall'alto verso il basso

source: record(s) in selection
it: Record in selezione

source: record(s) in table
it: Record nella tabella

source: New query
it: Nuova Ricerca

source: Step
it: Passo

source: Manual mode
it: Procedura manuale

source: Next step
it: Prossimo

source: Select the type of report you want to build.
it: Selezionate il tipo rapporto da costruire.

source: Run
it: Genera

source: Data Sources
it: Origine Dati

source: To continue building the report, select the master table from the pull-down menu.
it: Per continuare la costruzione del rapporto, selezionate la tabella principale dal menu a discesa.

source: Add data from the available fields.
it: Aggiungete i dati dai campi disponibili.

source: Sort Order
it: Ordinamento

source: Select the columns to sort.
it: Selezionate le colonne da ordinare.

source: Report columns
it: Colonne rapporto

source: Adding Computations
it: Aggiunta formule

source: Computations
it: Formule

source: Add the computation you want
it: Aggiungete le formule desiderate

source: Cell computations
it: Calcoli celle

source: Column computations
it: Calcoli colonne

source: Row computations
it: Calcoli righe

source: Sum
it: Somma (##S)

source: Average
it: Media (##A)

source: Minimum
it: Minimo (##N)

source: Maximum
it: Massimo (##X)

source: Count
it: Conteggio (##C)

# Destinazione Type
source: Output Type
it: Tipo Destinazione

# Select the destinazione type for this report.
source: Select the output type for this report.
it: Selezionate la destinazione di questo rapporto.

source: Column delimiter
it: Delimitatore colonna

source: Line delimiter
it: Delimitatore riga

source: Destination file name
it: Nome documento di destinazione

source: Destination HTML file name
it: Nome documento HTML di destinazione

source: HTML file template
it: Modello HTML

source: Browse ...
it: Sfoglia ...

source: Printer
it: Stampante

source: Text file
it: Docum. testo

source: HTML file
it: Docum. HTML

source: Parameters
it: Parametri

source: Adding fields (data sources) into a cross-tab report.
it: Aggiunta di campi (fonti di dati) in un rapporto incrociato.

source: 3-Cells
it: 3-Celle

source: Define the order in which you want the columns and rows sorted.
it: Definite l'ordine in cui desiderate ordinare le colonne e le righe.

source: Sort Order
it: Ordinamento

source: Select the Master Table
it: Selezionate la tabella principale

source: Presentation Template
it: Modello Presentazione

source: Presentation
it: Presentazione

source: Select a template for the report presentation.
it: Selezionate un modello per la presentazione del rapporto.

source: Adding Computations.
it: Aggiunta formule.

source: Computations
it: Formule

source: Define the Total for a Column.
it: Definite il totale di una colonna.

source: Title for Column Totals.
it: Titolo dei totali di colonna.

source: Define the Total for a Column
it: Definite il totale di una colonna

source: Column Totals
it: Totali colonna

source: Define the Total for Rows.
it: Definite il totale delle righe.

source: Title for Row Totals.
it: Titolo dei totali di riga.

source: Define the Total for Rows
it: Definite il totale delle righe

source: Row Totals
it: Totali riga

source: Select the data from the master table.
it: Selezionare i dati dalla tabella principale.

source: Templates
it: Modelli

source: Preview
it: Anteprima

source: Style
it: Stile

source: Alignment
it: Allineamento

source: Color
it: Colore

source: Format
it: Formato

source: Apply
it: Applica

source: Predefine computations
it: Formule predefinite

source: Preformatted computations
it: Formule preformattate

source: Free formula
it: Formula

source: Finalization
it: Finalizzazione

source: Finalizing the report.
it: Finalizzazione del rapporto.

source: Your report is now ready. Please choose which action you would like performed:
it: Il rapporto è pronto. Scegliete come procedere:

source: Back to manual mode
it: Ritorna a procedura manuale

source: Save
it: Registra

source: Save as ...
it: Registra come ...

source: Up
it: Su

source: Down
it: Giù

source: Delete
it: Cancella

source: Previous step
it: Precedente

source: Text properties
it: Proprietà testo

source: Font, Size, Justification
it: Font, Dimensione, Allineamento

source: Style (Bold, Italic, Underline)
it: Stile (Grassetto, Corsivo, Sottolineato)

source: Color (Text, Background)
it: Colore (Testo, Sfondo)

source: Borders
it: Bordi

source: Palettes visibility
it: Visibilità finestre fluttuanti

source: Done
it: Finito

# Deviazione Standard
source: Standard Deviation
it: Deviazione Standard (##D)

source: Border
it: Bordo

source: Execute
it: Genera

source: Load
it: Carica

source: Duplicate
it: Duplica

source: Cancel
it: Annulla

source: Report Name
it: Nome Rapporto

source: Description
it: Descrizione

source: Owner
it: Proprietario

source: Protected
it: Protetto

source: Modified :
it: Modificato :

source: By :
it: Da :

source: Page break
it: Interruzione di pagina

source: Extra space:
it: Spazio extra:

source: Print
it: Stampa

source: HEADER
it: INTESTAZIONE

source: FOOTER
it: PIE' DI PAGINA

source: Left
it: Sinistra

source: Center
it: Centro

source: Right
it: Destra

source: Picture
it: Immagine

source: Size
it: Dimensione

source: Section Height
it: Altezza Sezione

source: Bold
it: Grassetto

source: Italic
it: Corsivo

source: Underline
it: Sottolineato

source: Use Picture Height
it: Use Altezza Immagine

# HeaderFooterPlaceHolders
source: (Page: #P Date: #D Hour: #H)
it: (Pagina: #P Data: #D Ora: #H)

source: Text
it: Testo

source: Points
it: Punti

source: Load Selection
it: Carica Selezione

source: Reset Settings
it: Ripristina Impostazioni

source: Line Width
it: Spessore

source: Remove
it: Rimuovi

source: Load…
it: Carica…

# Report Protected Alert
source: This report is protected and can be modified only by:
it: Questo report è protetto e può essere modificato solo da:

source: New report
it: Nuovo report

source: Save as…
it: Registra come…

source: Open…
it: Apri…

source: Header and footer
it: Intestazione e Piè di Pagina

source: Page setup…
it: Formato di stampa…

source: Edit
it: Composizione

source: Cut;Copy;Paste;Select all
it: Taglia;Copia;Incolla;Seleziona tutto

source: File
it: Archivio

# Duplicate Report Name Alert
source: A report with the same name already exists, do you want to replace it?
it: Esiste già un report con lo stesso nome, vuoi sostituirlo?

# Confirm Report Deletion Alert
source: Do you want to delete the report
it: Vuoi cancellare il report

source: Choose a report:
it: Scegli un report:

source: Name:
it: Nome:

source: copy
it: copia

# Duplicate Name Alert
source: A report with this name already exists!
it: Esiste già un report con questo nome!

source: Untitled
it: Senza titolo

source: Close
it: Chiudi

# Destination popup items
source: Printer;File;(4D View;(4D Chart;HTML
it: Stampante;File;(4D View;(4D Chart;HTML

source: All
it: Tutto

# Erase dotted borders
source: Apply all settings of the editor Dotted border = erase
it: Applica tutte le impostazioni dell'editor Bordo punteggiato = cancella
