Repository: Mixage-Software/4D-Report-Manager
Catalog: Resources/*.lproj/TEXT.xlf
Languages: it

# Step1
source: The report will be built dynamically at the top of this window. The Report Wizard is designed to help you create a report step-by-step, but if you wish, you can go back to the manual mode without losing any of the settings.
it: Il rapporto sarà costruito in modo dinamico nella parte superiore della finestra. La procedura guidata è progettata per aiutarvi a creare un rapporto passo-passo, ma potete in qualsiasi punto tornare alla modalità manuale.

# Step1 suite
source: The list report is the most common type of report. This type of report allows you to display different types of data in a list, and provides the ability to sort orders as well as perform computations on them. Several types of presentations can be applied to the report according to your needs. The final report can also be printed or exported in a variety of output formats.
it: Il rapporto a "Lista" è il più comune tipo di rapporto. Questo tipo di rapporto permette di visualizzare diversi tipi di dati in una lista, e fornisce la possibilità di ordinarli ed eseguire calcoli su di essi. Diversi tipi di presentazioni possono essere applicati in base alle vostre esigenze. La rapporto finale può essere stampato o esportato in una varietà di formati di output.

# Step1 suite ...
source: The cross-tab report is a type of report that displays an analysis of two sets of numeric data. As with the list report, it is possible to perform computations on the values, and to use predefined templates for the presentation. The final report can be printed or exported in a variety of output formats.
it: Il rapporto a "Campi Incrociati" (Cross-tab) è un tipo di rapporto che mostra l'analisi di due insiemi di dati numerici. Come per il rapporto a lista, è possibile eseguire calcoli sui valori, e utilizzare modelli predefiniti per la presentazione. Il rapporto finale può essere stampato o esportato in una varietà di formati di output.

# Step3LR
source: To select fields for the report, drag-and-drop the items, or select a field from the list on the left and click on the single green arrow to add the field. Each field will be presented as a column in the report.
it: Per aggiungere un campo nel rapporto, selezionatelo dall'elenco a sinistra e cliccate sulla singola freccia verde singola. Potete anche trascinate gli elementi da aggiungere. Ogni campo sarà presentato come una colonna nel rapporto.

# Step4LR
source: Each field is now a column in the report. Some of these columns may be sorted. To add a sort, drag and drop the items, or select a report column from the list on the left and click on the single green arrow button to add the column. Each new sort order will create a new subtotal. This subtotal is displayed as new line between the "Detail" and "Grand total" lines.
it: Ogni campo è adesso una colonna nel rapporto. Alcune di queste colonne possono essere ordinate. Per aggiungere un ordinamento, selezionatelo dall'elenco a sinistra e cliccate sulla singola freccia verde singola. Potete anche trascinate gli elementi da aggiungere Ogni ordinamento creerà un nuovo totale parziale. Questo totale parziale viene visualizzato come nuova linea tra il "Dettaglio" e il "Totale Generale".

# Step5LR
source: There are five types of computations available. To add a computation, select the cell in the report area to which you want to add the computation, and check the appropriate box for the type of computation. To add a computation for an entire column, select the column by clicking on its header, and then check the appropriate box for the computation you want to add. You can also add computations on lines. Several computations can be associated with a single cell. Computations may be added to “Subtotal” or “Grand total” lines.
it: Aggiunta di una formula nelle celle di riassunto (totali parziali e totale generale). Per aggiungere una formula ad una cella, selezionare la cella e cliccare la formula richiesta. Per aggiungere una formula a tutte le celle riassuntive di una colonna, selezionare la colonna facendo clic sulla sua intestazione e quindi cliccare la formula richiesta. Diverse formule possono essere inserite in una singola cella usando la formattazione illustrata tra parentesi. E' inoltre possibile visualizzare nel riassunto il valore corrente di un campo usando la formattazione ##x dove x è il numero di colonna del campo.

# Step8X Step6LR
source: You can output a report into several types of formats, depending upon how you ultimately want to use the report. You can select the output type from the choices to the left. Specific parameters will be required according to the type of output selected.
it: Si possono scegliere divesi tipi di output, a seconda di come si desidera utilizzare il rapporto. Selezionate il tipo di output dalle scelte elencate a fianco. Parametri specifici saranno richiesti in base al tipo di output selezionato.

# Step8X Step6LR - txt
source: For this output type, you will need to enter a column delimiter, a line delimiter, and a destination file name without the extension. The report engine will use the delimiters to build the report as a simple text file.
it: Per questo tipo di output, sarà necessario inserire un delimitatore di colonna, un delimitatore di linea, e un nome file di destinazione senza l'estensione. Il programma utilizzerà i delimitatori per esportare il rapporto in un semplice file di testo.

# Step8X Step6LR - html
source: For this output type, the report engine will use an HTML template to build the report in an HTML file.
it: Per questo tipo di output, il programma utilizzerà un modello HTML per esportare il rapporto in un file HTML.

# Step3X
source: In order to be complete, the cross-tab report requires three data sources. One data source will define the column values, another data source will define the row values, and the last data source will define the cell values.
it: Per essere completo, il rapporto incrociato richiede tre fonti di dati. Una fonte di dati definirà i valori della colonna, un'altra fonte di dati definirà i valori della riga e l'ultima fonte dati definirà i valori delle celle.

# Step3X suite
source: Drag-and-drop the field here whose distinct values will define the columns.
it: Trascinate qui il campo da cui i valori distinti definiranno le colonne.

# Step3X suite 2
source: Drag-and-drop the field here whose distinct values will define the rows.
it: Trascinate qui il campo da cui i valori distinti definiranno le righe.

# Step3X suite 3
source: Drag-and-drop the field here that will define the computations for the cells.
it: Trascinate qui il campo che definirà i calcoli per le celle.

# Step4X
source: Columns and rows can be independently sorted in two directions or not sorted at all. To modify the sort, click on the arrows.
it: Le colonne e le righe possono essere ordinate in modo indipendente in due direzioni o non ordinate del tutto. Per modificare l'ordinamento, fate clic sulle frecce.

# Step2LR
source: It is necessary to select a master table in order to indicate the type of data with which you want to work. The report engine will only use the records selected in this table.
it: E 'necessario selezionare la tabella principale da cui estrarre i dati. Il programma utilizzerà solo i record selezionati in questa tabella.

# Step2LR Suite
source: The report engine will use the records you selected from the master table. It is possible to modify the data selected from this table with the “New query” button. Using the standard query editor, you can specify a new selection.
it: Il programma utilizzerà i record selezionati nella tabella principale. E 'possibile modificare i dati selezionati in questa tabella con il pulsante "Nuova Ricerca".

# Step7LR
source: Several templates are available for report presentation. For each template, you can choose which user interface parameters you want to activate. The “Apply” button will apply the selected presentation type to the report in the top area.
it: Diversi modelli sono disponibili per la presentazione dei report. Per ogni modello, è possibile scegliere quali parametri di interfaccia utente si desiderano attivare. Il pulsante "Applica" formatterà il rapporto nell'area superiore della finestra.

# Step5X
source: There are five types of computations available. To add a computation, check the appropriate box for the type of computation you want added. Several computations can be associated with a single cell. Computations may be added only to the cells.
it: Ci sono sei tipi di calcoli disponibili. Per aggiungere un calcolo, selezionate la cella di destinazione e cliccate il pulsante appropriato. Diversi calcoli possono essere associati a una singola cella. I calcoli possono essere aggiunti solo alle celle.

# Step6X
source: There are five types of computations available. To add a computation, check the appropriate box for the type of computation you want added. Several computations can be associated with a single cell. Titles can be associated with column totals.
it: Ci sono sei tipi di calcoli disponibili. Per aggiungere un calcolo, selezionate la cella di destinazione e cliccate il pulsante appropriato. Diversi calcoli possono essere associati a una singola cella. Dei titoli possono essere aggiunti ai totali di colonna.

# Step7X
source: There are five types of computations available. To add a computation, check the appropriate box for the type of computation you want added. Several computations can be associated with a single cell. Titles can be associated with row totals.
it: Ci sono sei tipi di calcoli disponibili. Per aggiungere un calcolo, selezionate la cella di destinazione e cliccate il pulsante appropriato. Diversi calcoli possono essere associati a una singola cella. Dei titoli possono essere aggiunti ai totali di riga.

# Step8X Step6LR - Printer
source: For this output type, the report engine will use the standard printer settings dialog before printing.
it: Scegliendo questo tipo di output, il rapporto verrà stampato dopo la richiesta dei parametri di stampa.

# Step8X Step6LR - View
source: For this output type, the report engine will generate the report into a 4D View document.
it: Scegliendo questo tipo di output, il programma genererà il rapporto in un documento 4D View.

# Step8X Step6LR - Chart
source: For this output type, the report engine will generate the report into a chart document.
it: Scegliendo questo tipo di output, il programma genererà il rapporto in un documento grafico.
